Examinator/src/Enums/СтатусыПроцессаПреподаванияСУО/СтатусыПроцессаПреподаванияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроцессаПреподаванияСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Провожу</name>
  </enumValues>
  <enumValues>
    <name>Провел</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/СтатусыПроцессаПреподаванияСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ЗначениеВЧисло(Значение) Экспорт
	
	Если Значение = Перечисления.СтатусыПроцессаПреподаванияСУО.Запланировано Тогда
		Возврат 1;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПроцессаПреподаванияСУО.Провожу Тогда
		Возврат 2;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПроцессаПреподаванияСУО.Провел Тогда
		Возврат 3;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыПроцессаПреподаванияСУО.Завершено Тогда
		Возврат 4;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЧислоВЗначение(ЗначениеЧисло) Экспорт
	
	Если ЗначениеЧисло = 1 Тогда
		Возврат Перечисления.СтатусыПроцессаПреподаванияСУО.Запланировано;
	КонецЕсли;
	
	Если ЗначениеЧисло = 2 Тогда
		Возврат Перечисления.СтатусыПроцессаПреподаванияСУО.Провожу;
	КонецЕсли;
	
	Если ЗначениеЧисло = 3 Тогда
		Возврат Перечисления.СтатусыПроцессаПреподаванияСУО.Провел;
	КонецЕсли;
	
	Если ЗначениеЧисло = 4 Тогда
		Возврат Перечисления.СтатусыПроцессаПреподаванияСУО.Завершено;
	КонецЕсли;
	
	Возврат Перечисления.СтатусыПроцессаПреподаванияСУО.ПустаяСсылка();	
	
КонецФункции

Функция ПредставлениеЗначения(Значение) Экспорт
	Возврат Строка(Значение);
КонецФункции

Функция ЧислоВПредставление(ЗначениеЧисло) Экспорт
	Возврат ПредставлениеЗначения(ЧислоВЗначение(ЗначениеЧисло));
КонецФункции

#КонецОбласти
	
#КонецЕсли
